open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_can.c
/* SPDX-License-Identifier: Apache-2.0 */
/****************************************************************************
 * tests/host/bk7258/modules/ap/test_bk7258_can.c
 *
 * Host test suite for the BK7258 classic-CAN lower-half
 * (chips/bk7258/ap/bk7258_can.c) against the SDK mock
 * (framework/mock_sdk_can.c).  The driver is compiled UNMODIFIED:
 *
 *   - The rx thread is a real pthread: fire_rx_isr() posts the driver's
 *     rx_sem, the thread drains the SDK FIFO (bk_can_receive) and calls
 *     the upper-half can_receive() record.
 *   - Tests synchronize with the rx thread by polling the upper-half
 *     record (3 s deadline), never by sleeping for a fixed duration.
 *   - Every test that enables setup() must leave the driver uninitialized
 *     (uninitialize stops and joins the rx thread) so the singleton and
 *     mock are clean for the next test.
 ****************************************************************************/

#include <stdarg.h>
#include <stddef.h>
#include <setjmp.h>
#include <stdint.h>
#include <string.h>
#include <time.h>
#include <unistd.h>
#include <errno.h>

#include <cmocka.h>

#include <nuttx/can/can.h>

#include <arch/chip/bk7258_can.h>

#include "mock_sdk_can.h"

static FAR struct can_dev_s *g_dev;
static FAR const struct can_ops_s *g_ops;

static int test_setup(FAR void **state)
{
  mock_sdk_can_reset();
  g_dev = NULL;
  g_ops = NULL;
  return 0;
}

static int test_teardown(FAR void **state)
{
  /* If the test left the driver initialized, tear it down so the rx
   * thread is joined before the mock state is discarded. */
  if (g_dev != NULL)
    {
      (void)bk7258_can_uninitialize(g_dev);
    }

  return 0;
}

static void mock_can_poll_until(unsigned int want)
{
  struct timespec a;
  struct timespec b;

  clock_gettime(CLOCK_MONOTONIC, &a);
  while (mock_can_upper_rx_count() < want)
    {
      clock_gettime(CLOCK_MONOTONIC, &b);
      assert_true(b.tv_sec - a.tv_sec < 3);
      usleep(500);
    }
}

static int mock_can_find_call(enum mock_sdk_can_fn_e fn)
{
  FAR struct mock_can_log_s *log = mock_sdk_can_log();
  int i;

  for (i = 0; i < log->count; i++)
    {
      if (log->call[i].fn == fn)
        {
          return i;
        }
    }

  return -1;
}

static void mock_can_settle_rx(void)
{
  int i;

  for (i = 0; i < 50 && !mock_sdk_can_rx_empty(); i++)
    {
      mock_sdk_can_fire_rx_isr();
      usleep(2000);
    }

  assert_true(mock_sdk_can_rx_empty());
}

static void mock_can_setup_dev(void)
{
  assert_int_equal(bk7258_can_initialize(&g_dev), 0);
  g_ops = g_dev->cd_ops;
}

static void mock_can_setup_configured(void)
{
  mock_can_setup_dev();
  assert_int_equal(g_ops->co_setup(g_dev), 0);
  g_ops->co_rxint(g_dev, true);
}

static void mock_can_send_frame(uint16_t id, uint8_t dlc,
                                FAR const uint8_t *data)
{
  struct can_msg_s msg;

  memset(&msg, 0, sizeof(msg));
  msg.cm_hdr.ch_id = id;
  msg.cm_hdr.ch_dlc = dlc;
  if (data != NULL)
    {
      memcpy(msg.cm_data, data, dlc);
    }

  assert_int_equal(g_ops->co_send(g_dev, &msg), 0);
}

static void test_can_init_ok(FAR void **state)
{
  FAR struct can_dev_s *dev = NULL;

  assert_int_equal(bk7258_can_initialize(&dev), 0);
  assert_non_null(dev);
  assert_non_null(dev->cd_ops);
  assert_non_null(dev->cd_priv);
  assert_int_equal(dev->cd_crefs, 0);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_DRIVER_INIT), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_REGISTER_ISR), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_REGISTER_ERR), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_SET_LBMI), 1);
  assert_int_equal(mock_sdk_can_call(0)->fn, MOCK_CAN_FN_DRIVER_INIT);
  assert_int_equal(mock_sdk_can_call(1)->fn, MOCK_CAN_FN_REGISTER_ISR);
  assert_int_equal(mock_sdk_can_call(2)->fn, MOCK_CAN_FN_REGISTER_ERR);
  assert_int_equal(mock_sdk_can_call(3)->fn, MOCK_CAN_FN_SET_LBMI);
  assert_int_equal(mock_sdk_can_call(3)->a0, 0);

  assert_int_equal(bk7258_can_uninitialize(dev), 0);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_DRIVER_DEINIT), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_ABORT_ALL), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_REGISTER_ISR), 2);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_REGISTER_ERR), 2);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_SET_LBMI), 2);
  g_dev = NULL;
}

static void test_can_init_double(FAR void **state)
{
  FAR struct can_dev_s *dev = NULL;
  FAR struct can_dev_s *again = NULL;

  assert_int_equal(bk7258_can_initialize(&dev), 0);
  assert_int_equal(bk7258_can_initialize(&again), -EBUSY);
  assert_null(again);
  assert_int_equal(bk7258_can_uninitialize(dev), 0);
  g_dev = NULL;
}

static void test_can_init_driver_init_fail(FAR void **state)
{
  FAR struct can_dev_s *dev = NULL;

  mock_sdk_can_set_ret(MOCK_CAN_FN_DRIVER_INIT, BK_ERR_NOT_INIT);
  assert_int_equal(bk7258_can_initialize(&dev), -ENODEV);
  assert_null(dev);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_DRIVER_DEINIT), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_REGISTER_ISR), 0);

  mock_sdk_can_set_ret(MOCK_CAN_FN_DRIVER_INIT, 0);
  assert_int_equal(bk7258_can_initialize(&dev), 0);
  assert_non_null(dev);
  assert_int_equal(bk7258_can_uninitialize(dev), 0);
  g_dev = NULL;
}

static void test_can_uninit_never_init(FAR void **state)
{
  FAR struct can_dev_s *dev = NULL;

  assert_int_equal(bk7258_can_uninitialize(dev), -EINVAL);
  assert_int_equal(bk7258_can_uninitialize(NULL), -EINVAL);

  /* A stray non-owning pointer must be rejected. */
  assert_int_equal(bk7258_can_uninitialize((FAR struct can_dev_s *)0x1), -EINVAL);
}

static void test_can_uninit_wrong_dev(FAR void **state)
{
  struct can_dev_s foreign;

  memset(&foreign, 0, sizeof(foreign));
  mock_can_setup_dev();
  assert_int_equal(bk7258_can_uninitialize(&foreign), -EINVAL);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_uninit_crefs(FAR void **state)
{
  mock_can_setup_dev();
  g_dev->cd_crefs = 1;
  assert_int_equal(bk7258_can_uninitialize(g_dev), -EBUSY);
  g_dev->cd_crefs = 0;
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_setup_ok(FAR void **state)
{
  static const uint8_t payload[4] = { 5, 6, 7, 8 };

  mock_can_setup_dev();
  assert_int_equal(g_ops->co_setup(g_dev), 0);
  assert_int_equal(mock_can_kthread_count(), 1);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_SET_LBMI), 2);

