open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_can.c
  g_ops->co_rxint(g_dev, true);
  mock_sdk_can_rx_enqueue(0x345, payload, sizeof(payload));
  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(1);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_id, 0x345);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_dlc, 4);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_rtr, 0);
  assert_memory_equal(mock_can_upper_rx(0)->data, payload, sizeof(payload));
  assert_true(mock_sdk_can_rx_empty());

  g_ops->co_txint(g_dev, true);
  mock_can_send_frame(0x123, 3, payload);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_SEND_PTB), 1);
  assert_int_equal(mock_sdk_can_last_tx_id(), 0x123);
  assert_int_equal(mock_sdk_can_last_tx_size(), 3);
  assert_memory_equal(mock_sdk_can_last_tx_payload(), payload, 3);
  mock_sdk_can_fire_tx_isr();
  assert_int_equal(mock_can_upper_txdone_count(), 1);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_setup_gate(FAR void **state)
{
  FAR struct can_dev_s *dev = NULL;

  assert_int_equal(bk7258_can_initialize(&dev), 0);
  g_ops = dev->cd_ops;
  g_dev = dev;

  assert_int_equal(g_ops->co_setup(dev), 0);
  assert_int_equal(g_ops->co_setup(dev), -EBUSY);
  g_ops->co_shutdown(dev);
  assert_int_equal(g_ops->co_setup(dev), 0);
  assert_int_equal(mock_can_kthread_count(), 2);
  assert_int_equal(bk7258_can_uninitialize(dev), 0);
  g_dev = NULL;
}

static void test_can_stale_ops_after_uninit(FAR void **state)
{
  struct canioc_connmodes_s modes;
  struct canioc_bittiming_s timing;
  struct can_msg_s msg;

  mock_can_setup_configured();
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);

  /* The lower-half is a single-instance singleton; after uninitialize
   * every entry point must reject without touching the SDK. */
  assert_int_equal(g_ops->co_setup(g_dev), -ENODEV);
  memset(&msg, 0, sizeof(msg));
  msg.cm_hdr.ch_id = 0x100;
  msg.cm_hdr.ch_dlc = 2;
  assert_int_equal(g_ops->co_send(g_dev, &msg), -ENODEV);
  memset(&modes, 0, sizeof(modes));
  modes.bm_loopback = 1;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_CONNMODES,
                                   (unsigned long)&modes), -ENODEV);
  memset(&timing, 0, sizeof(timing));
  timing.bt_baud = 500000;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_BITTIMING,
                                   (unsigned long)&timing), -ENODEV);
  assert_int_equal(g_ops->co_cancel(g_dev, &msg), false);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_SEND_PTB), 0);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_ABORT_PTB), 0);

  g_dev = NULL;
}

static void test_can_send_gate(FAR void **state)
{
  struct can_msg_s msg;
  struct can_msg_s rtr;
  struct can_msg_s big;
  struct can_msg_s wide;
  static const uint8_t data[8] = { 1, 2, 3, 4, 5, 6, 7, 8 };

  mock_can_setup_configured();

  memset(&msg, 0, sizeof(msg));
  msg.cm_hdr.ch_id = 0x100;
  msg.cm_hdr.ch_dlc = 8;
  memcpy(msg.cm_data, data, 8);
  assert_int_equal(g_ops->co_send(g_dev, &msg), 0);
  mock_sdk_can_fire_tx_isr();

  /* CAN permits a zero-length data frame, including identifier zero. */
  memset(&msg, 0, sizeof(msg));
  assert_int_equal(g_ops->co_send(g_dev, &msg), 0);
  assert_int_equal(mock_sdk_can_last_tx_id(), 0u);
  assert_int_equal(mock_sdk_can_last_tx_size(), 0u);
  mock_sdk_can_fire_tx_isr();
  assert_int_equal(g_ops->co_send(g_dev, NULL), -EINVAL);

  memset(&big, 0, sizeof(big));
  big.cm_hdr.ch_id = 0x100;
  big.cm_hdr.ch_dlc = 9;
  assert_int_equal(g_ops->co_send(g_dev, &big), -EINVAL);

  memset(&rtr, 0, sizeof(rtr));
  rtr.cm_hdr.ch_id = 0x100;
  rtr.cm_hdr.ch_dlc = 8;
  rtr.cm_hdr.ch_rtr = 1;
  assert_int_equal(g_ops->co_send(g_dev, &rtr), -ENOTSUP);

  memset(&wide, 0, sizeof(wide));
  wide.cm_hdr.ch_id = 0x800;
  wide.cm_hdr.ch_dlc = 8;
  assert_int_equal(g_ops->co_send(g_dev, &wide), -EINVAL);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_send_busy(FAR void **state)
{
  struct can_msg_s msg;
  static const uint8_t data[2] = { 1, 2 };

  mock_can_setup_configured();
  g_ops->co_txint(g_dev, true);

  mock_can_send_frame(0x100, 2, data);
  memset(&msg, 0, sizeof(msg));
  msg.cm_hdr.ch_id = 0x100;
  msg.cm_hdr.ch_dlc = 2;
  assert_int_equal(g_ops->co_send(g_dev, &msg), -EBUSY);
  assert_int_equal(g_ops->co_send(g_dev, &msg), -EBUSY);
  mock_sdk_can_fire_tx_isr();
  assert_int_equal(mock_can_upper_txdone_count(), 1);
  mock_can_send_frame(0x100, 2, data);
  mock_sdk_can_fire_tx_isr();
  assert_int_equal(mock_can_upper_txdone_count(), 2);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_send_ptb_fail(FAR void **state)
{
  struct can_msg_s msg;

  mock_can_setup_configured();

  mock_sdk_can_set_ret_once(MOCK_CAN_FN_SEND_PTB, BK_ERR_TIMEOUT);
  memset(&msg, 0, sizeof(msg));
  msg.cm_hdr.ch_id = 0x100;
  msg.cm_hdr.ch_dlc = 2;
  assert_int_equal(g_ops->co_send(g_dev, &msg), -ETIMEDOUT);

  /* The failed submission must have released tx_busy. */
  assert_int_equal(g_ops->co_send(g_dev, &msg), 0);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_SEND_PTB), 2);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_cancel(FAR void **state)
{
  static const uint8_t data[2] = { 9, 8 };
  struct can_msg_s msg;

  mock_can_setup_configured();

  mock_can_send_frame(0x100, 2, data);
  assert_int_equal(g_ops->co_cancel(g_dev, &msg), true);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_ABORT_PTB), 1);
  assert_int_equal(g_ops->co_cancel(g_dev, &msg), false);

  mock_can_send_frame(0x100, 2, data);
  assert_int_equal(g_ops->co_cancel(g_dev, NULL), true);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_ABORT_PTB), 2);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_rx_frame(FAR void **state)
{
  static const uint8_t payload[4] = { 5, 6, 7, 8 };

  mock_can_setup_configured();

