open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_can.c
  mock_sdk_can_rx_enqueue(0x345, payload, sizeof(payload));
  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(1);

  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_id, 0x345);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_dlc, 4);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_rtr, 0);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_error, 0);
  assert_memory_equal(mock_can_upper_rx(0)->data, payload, sizeof(payload));
  assert_true(mock_sdk_can_rx_empty());

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_rx_overrun_dlc(FAR void **state)
{
  static const uint8_t bad[9] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
  static const uint8_t good[2] = { 0xaa, 0xbb };

  mock_can_setup_configured();

  mock_sdk_can_rx_enqueue(0x200, bad, sizeof(bad));
  mock_sdk_can_fire_rx_isr();
  mock_can_settle_rx();
  assert_int_equal(mock_can_upper_rx_count(), 0);

  /* The corrupt record must not wedge the drain state. */
  mock_sdk_can_rx_enqueue(0x201, good, sizeof(good));
  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(1);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_id, 0x201);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_dlc, 2);
  assert_memory_equal(mock_can_upper_rx(0)->data, good, sizeof(good));

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_rx_ext_id_dropped(FAR void **state)
{
  static const uint8_t payload[2] = { 1, 2 };

  mock_can_setup_configured();

  mock_sdk_can_rx_enqueue(0x800, payload, sizeof(payload));
  mock_sdk_can_fire_rx_isr();
  mock_can_settle_rx();
  assert_int_equal(mock_can_upper_rx_count(), 0);

  mock_sdk_can_rx_enqueue(0x100, payload, sizeof(payload));
  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(1);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_id, 0x100);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_rx_budget(FAR void **state)
{
  static const uint8_t payload[2] = { 1, 2 };
  int i;

  mock_can_setup_configured();

  for (i = 0; i < 10; i++)
    {
      mock_sdk_can_rx_enqueue(0x100 + i, payload, sizeof(payload));
    }

  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(10);
  assert_int_equal(mock_can_upper_rx_count(), 10);
  assert_int_equal(mock_can_upper_rx(9)->hdr.ch_id, 0x109);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_err_report(FAR void **state)
{
  mock_can_setup_configured();

  mock_sdk_can_fire_err_isr();
  mock_can_poll_until(1);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_id, CAN_ERROR_CONTROLLER);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_dlc, CAN_ERR_DLC);
  assert_int_equal(mock_can_upper_rx(0)->hdr.ch_error, 1);
  assert_int_equal(mock_can_upper_rx(0)->data[1], CAN_ERROR1_UNSPEC);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_ioctl(FAR void **state)
{
  struct canioc_connmodes_s modes;
  struct canioc_bittiming_s timing;
  struct canioc_connmodes_s silent;
  static const uint8_t data[2] = { 1, 2 };

  mock_can_setup_configured();

  memset(&modes, 0, sizeof(modes));
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_GET_CONNMODES,
                                   (unsigned long)&modes), 0);
  assert_int_equal(modes.bm_loopback, 0);
  assert_int_equal(modes.bm_silent, 0);

  modes.bm_loopback = 1;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_CONNMODES,
                                   (unsigned long)&modes), 0);
  assert_true(mock_sdk_can_lbmi());

  memset(&modes, 0, sizeof(modes));
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_GET_CONNMODES,
                                   (unsigned long)&modes), 0);
  assert_int_equal(modes.bm_loopback, 1);

  memset(&silent, 0, sizeof(silent));
  silent.bm_silent = 1;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_CONNMODES,
                                   (unsigned long)&silent), -ENOTSUP);
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_CONNMODES, 0),
                   -EINVAL);
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_GET_CONNMODES, 0),
                   -EINVAL);

  memset(&timing, 0, sizeof(timing));
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_GET_BITTIMING,
                                   (unsigned long)&timing), 0);
  assert_int_equal(timing.bt_baud, 1000000);

  timing.bt_baud = 500000;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_BITTIMING,
                                   (unsigned long)&timing), 0);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_BITRATE_CONFIG), 1);
  assert_int_equal(mock_sdk_can_last_s_speed(), CAN_BR_500K);
  assert_int_equal(mock_sdk_can_last_f_speed(), CAN_BR_4M);
  assert_int_equal(mock_sdk_can_call(mock_can_find_call(
                                       MOCK_CAN_FN_BITRATE_CONFIG))->a0,
                   CAN_BR_500K);

  memset(&timing, 0, sizeof(timing));
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_GET_BITTIMING,
                                   (unsigned long)&timing), 0);
  assert_int_equal(timing.bt_baud, 500000);

  timing.bt_baud = 123456;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_BITTIMING,
                                   (unsigned long)&timing), -ENOTSUP);
  timing.bt_baud = 500000;
  timing.bt_tseg1 = 1;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_BITTIMING,
                                   (unsigned long)&timing), -ENOTSUP);

  /* tx_busy blocks reconfiguration and mode changes. */
  mock_can_send_frame(0x100, 2, data);
  memset(&timing, 0, sizeof(timing));
  timing.bt_baud = 250000;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_BITTIMING,
                                   (unsigned long)&timing), -EBUSY);
  modes.bm_loopback = 0;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_CONNMODES,
                                   (unsigned long)&modes), -EBUSY);
  mock_sdk_can_fire_tx_isr();

