open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/modules/ap/test_bk7258_can.c
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_BUSOFF_RECOVERY, 0), 0);
  assert_int_equal(mock_sdk_can_calls(MOCK_CAN_FN_CTRL), 1);
  assert_int_equal(mock_sdk_can_call(mock_can_find_call(MOCK_CAN_FN_CTRL))->fn,
                   MOCK_CAN_FN_CTRL);
  assert_int_equal(mock_sdk_can_call(mock_can_find_call(MOCK_CAN_FN_CTRL))->a0,
                   CMD_CAN_BUSOFF_CLR);

  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_ADD_STDFILTER, 0),
                   -ENOTSUP);
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_DEL_STDFILTER, 0),
                   -ENOTSUP);
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_ADD_EXTFILTER, 0),
                   -ENOTSUP);
  assert_int_equal(g_ops->co_ioctl(g_dev, 0xdead, 0), -ENOTTY);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_unconfigured_gates(FAR void **state)
{
  struct canioc_connmodes_s modes;
  struct canioc_bittiming_s timing;
  struct can_msg_s msg;

  mock_can_setup_dev();

  memset(&msg, 0, sizeof(msg));
  msg.cm_hdr.ch_id = 0x100;
  msg.cm_hdr.ch_dlc = 2;
  assert_int_equal(g_ops->co_send(g_dev, &msg), -ENODEV);
  assert_int_equal(g_ops->co_setup(g_dev), 0);
  g_ops->co_shutdown(g_dev);

  memset(&modes, 0, sizeof(modes));
  modes.bm_loopback = 1;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_CONNMODES,
                                   (unsigned long)&modes), -ENODEV);
  memset(&timing, 0, sizeof(timing));
  timing.bt_baud = 500000;
  assert_int_equal(g_ops->co_ioctl(g_dev, CANIOC_SET_BITTIMING,
                                   (unsigned long)&timing), -ENODEV);

  assert_int_equal(g_ops->co_remoterequest(g_dev, 0x100), -ENOTSUP);

  g_ops->co_errhandle(g_dev);
  assert_int_equal(mock_can_upper_rx_count(), 0);

  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_reset_recycle(FAR void **state)
{
  static const uint8_t payload[2] = { 3, 4 };

  mock_can_setup_configured();

  mock_sdk_can_rx_enqueue(0x100, payload, sizeof(payload));
  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(1);

  g_ops->co_reset(g_dev);
  assert_int_equal(mock_can_upper_rx_count(), 1);

  assert_int_equal(g_ops->co_setup(g_dev), 0);
  assert_int_equal(mock_can_kthread_count(), 2);
  g_ops->co_rxint(g_dev, true);

  mock_sdk_can_rx_enqueue(0x101, payload, sizeof(payload));
  mock_sdk_can_fire_rx_isr();
  mock_can_poll_until(2);
  assert_int_equal(mock_can_upper_rx(1)->hdr.ch_id, 0x101);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

static void test_can_txdone_gating(FAR void **state)
{
  static const uint8_t data[2] = { 1, 2 };

  mock_can_setup_configured();

  mock_can_send_frame(0x100, 2, data);
  mock_sdk_can_fire_tx_isr();
  assert_int_equal(mock_can_upper_txdone_count(), 0);

  g_ops->co_txint(g_dev, true);
  mock_can_send_frame(0x100, 2, data);
  mock_sdk_can_fire_tx_isr();
  assert_int_equal(mock_can_upper_txdone_count(), 1);

  g_ops->co_shutdown(g_dev);
  assert_int_equal(bk7258_can_uninitialize(g_dev), 0);
  g_dev = NULL;
}

int main(int argc, FAR char *argv[])
{
  const struct CMUnitTest tests[] =
  {
    cmocka_unit_test_setup_teardown(test_can_init_ok, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_init_double, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_init_driver_init_fail,
                                    test_setup, test_teardown),
    cmocka_unit_test_setup_teardown(test_can_uninit_never_init, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_uninit_wrong_dev, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_uninit_crefs, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_setup_ok, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_setup_gate, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_stale_ops_after_uninit,
                                    test_setup, test_teardown),
    cmocka_unit_test_setup_teardown(test_can_send_gate, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_send_busy, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_send_ptb_fail, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_cancel, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_rx_frame, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_rx_overrun_dlc, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_rx_ext_id_dropped, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_rx_budget, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_err_report, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_ioctl, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_unconfigured_gates, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_reset_recycle, test_setup,
                                    test_teardown),
    cmocka_unit_test_setup_teardown(test_can_txdone_gating, test_setup,
                                    test_teardown),
  };

  return cmocka_run_group_tests(tests, NULL, NULL);
}
